In [1]:
import numpy as np
import pandas as pd

In [2]:
righe=list('ABCDE')
colonne=list('FGHIL')

In [7]:
df=pd.DataFrame(np.random.randint(10,size=(5,5)),index=righe,columns=colonne)

In [8]:
df

   F  G  H  I  L
A  2  1  5  9  4
B  6  0  6  6  8
C  7  3  4  8  5
D  3  0  7  5  9
E  0  8  1  1  7

In [27]:
df['NUOVA']=df['F']+df['G']

In [28]:
df

   F  G  H  I  L  NUOVA
A  2  1  5  9  4      3
B  6  0  6  6  8      6
C  7  3  4  8  5     10
D  3  0  7  5  9      3

In [29]:
df.drop('NUOVA',axis=1,inplace=True)

In [30]:
df

   F  G  H  I  L
A  2  1  5  9  4
B  6  0  6  6  8
C  7  3  4  8  5
D  3  0  7  5  9

In [19]:
df.drop('E',inplace=True)

In [20]:
df

   F  G  H  I  L
A  2  1  5  9  4
B  6  0  6  6  8
C  7  3  4  8  5
D  3  0  7  5  9

In [21]:
df.loc['B']

F    6
G    0
H    6
I    6
L    8
Name: B, dtype: int32

In [22]:
df.iloc[1]

F    6
G    0
H    6
I    6
L    8
Name: B, dtype: int32

In [23]:
df.loc[['A','D']]

   F  G  H  I  L
A  2  1  5  9  4
D  3  0  7  5  9

In [24]:
df.iloc[[0,3]]

   F  G  H  I  L
A  2  1  5  9  4
D  3  0  7  5  9

In [26]:
df.loc['A']['H']

5

In [31]:
df.iloc[0][2]

5